# Номера 19-21
## Навигация
- [Одна куча](#одна-куча)
-

# Важно!!!
**Если кто-то делает неудачный ход, то мы меняем `all` -> `any`** 
## Одна куча
> (Демо 2024) Два игрока, Петя и Ваня, играют в следующую игру. Перед игроками лежит куча камней. Игроки ходят по очереди, первый ход делает Петя. За один ход игрок может добавить в кучу один камень или увеличить количество камней в куче в два раза. Для того чтобы делать ходы, у каждого игрока есть неограниченное количество камней.<br>
Игра завершается в тот момент, когда количество камней в куче становится не менее 129. Победителем считается игрок, сделавший последний ход, т.е. первым получивший кучу из 129 или больше камней.<br>
В начальный момент в куче было S камней, 1 ≤ S ≤ 128.<br>
Будем говорить, что игрок имеет выигрышную стратегию, если он может выиграть при любых ходах противника.<br>
>
- №19<br>
  > Укажите минимальное значение S, при котором Петя не может выиграть за один ход, но при любом ходе Пети Ваня может выиграть своим первым ходом.

  `x` - количество камней в куче<br>
  `pos` - текущий ход <br>
    ```python
    def f(x, pos, win):
        if x >= 129:  # Указываем условие окончания игры
            return pos in win
        if pos > max(win):
            return 0
        moves = [f(x + 1, pos + 1, win), f(x * 2, pos + 1, win)]  # Записываем все возможные ходы
        if pos % 2 != max(win) % 2:
            return any(moves)  # Ходит наш игрок
        else:
            return all(moves)  # Ходит противник
    
    for s in range(1, 128 + 1):  # Перебираем стартовое количество камней в куче
        if f(s, 0, [1]) == 0 and f(s, 0, [2]) == 1:
            print('№ 19:', s)
    
    # П1 В1 П2 В2
    # 1  2  3  4
    ```
- №20
  > Для игры, описанной в задании 19, найдите два наименьших значения S, при которых у Пети есть выигрышная стратегия, причём одновременно выполняются два условия:
  – Петя не может выиграть за один ход;
  – Петя может выиграть своим вторым ходом независимо от того, как будет ходить Ваня.
  Найденные значения запишите в ответе в порядке возрастания.
    ```python
    def f(x, pos, win):
        if x >= 129:  # Указываем условие окончания игры
            return pos in win
        if pos > max(win):
            return 0
        moves = [f(x + 1, pos + 1, win), f(x * 2, pos + 1, win)]  # Записываем все возможные ходы
        if pos % 2 != max(win) % 2:
            return any(moves)  # Ходит наш игрок
        else:
            return all(moves)  # Ходит противник

    for s in range(1, 128 + 1):  # Перебираем стартовое количество камней в куче
        if f(s, 0, [1]) == 0 and f(s, 0, [3]) == 1:
            print('№ 20:', s)
    
    # П1 В1 П2 В2
    # 1  2  3  4
    ```
- №21
  > Для игры, описанной в задании 19, найдите минимальное значение S, при котором одновременно выполняются два условия:<br>
  – у Вани есть выигрышная стратегия, позволяющая ему выиграть первым или вторым ходом при любой игре Пети;<br>
  – у Вани нет стратегии, которая позволит ему гарантированно выиграть первым ходом.<br>
  Если найдено несколько значений S, в ответе запишите минимальное из них.<br>
```python
def f(x, pos, win):
    if x >= 129:  # Указываем условие окончания игры
        return pos in win
    if pos > max(win):
        return 0
    moves = [f(x + 1, pos + 1, win), f(x * 2, pos + 1, win)]  # Записываем все возможные ходы
    if pos % 2 != max(win) % 2:
        return any(moves)  # Ходит наш игрок
    else:
        return all(moves)  # Ходит противник

for s in range(1, 128 + 1):  # Перебираем стартовое количество камней в куче
    if f(s, 0, [2, 4]) == 1 and f(s, 0, [2]) == 0:
        print('№ 21:', s)

    # П1 В1 П2 В2
    # 1  2  3  4
```
## Еще варик
```python
def f(s,m):
    if s==0: return m%2==0
    if m==0: return 0
    h = [f(s-4,m-1),f(s-3,m-1),f(s//2,m-1)]
    return any(h) if (m-1)%2==0 else all(h)
print('19',[s for s in range(1,39) if f(s,2)])
print('20',[s for s in range(1,39) if not f(s,1) and f(s,3)])

print('21',[s for s in range(1,39) if not f(s,2) and f(s,4)])
```