>Алгоритм вычисления значения функции F(n), где n – натуральное число, задан следующими соотношениями:
> ```
> F(1) = 3;
> F(2) = 1; 
> F(n) = 68 + F(n–2), при n>2;
> ```
> Чему равно значение функции F(13)?


```python
def f(n):
    if n == 1:
        return 3
    if n == 2:
        return 1
    return 68 + f(n - 2)


print(f(13))
```

## Help
Декоратор
```python
from functools import lru_cache
```
```python
from sys import setrecursionlimit
```

## Алг
> 
>Алгоритм вычисления функции F(n), где n – натуральное число, задан следующими соотношениями:
> - F(n) = 1, при n = 1,
> - F(n) = n + F(n - 1), если n > 1.<br>
>Чему равно значение выражения F(2023) - F(2019)?

```python
def f(n):
    if n == 1:
        return 1
    if n > 1:
        return n + f(n-1) 
print(f(2023) - f(2019))
```
Если программа выводит число, то записываем его в ответ. Задача решена.
Если возникает ошибка или программа ничего не выводит тогда выполняем пункт 2.
```python
from functools import *
@lru_cache(None)
def f(n):
    if n == 1:
        return 1
    if n > 1:
        return n + f(n-1)    
print(f(2023) - f(2019))
```
Добавляем цикл с запуском функции
```python
from functools import *

@lru_cache(None)
def f(n):
    if n == 1:
        return 1
    if n > 1:
        return n + f(n-1)


# В цикле идём от минимального числа, до максимального 
# из чисел, которые видите в условии
for i in range(1, 2023, 1):
    f(i)
    
print(f(2023) - f(2019))
```
В цикле запускаем функцию от минимального числа, которое видите в условии, до максимального. В данной задаче это 1 и 2023.
Если программа выводит число, то записываем его в ответ. Задача решена.
Если возникает ошибка или программа ничего не выводит тогда в цикле меняем порядок на обратный. Идём от максимального числа до минимального.
```python
from functools import *

@lru_cache(None)
def f(n):
    if n == 1:
        return 1
    if n > 1:
        return n + f(n-1)

for i in range(2023, 1, -1): # Не забудьте поставить шаг цикла -1
    f(i)
    
print(f(2023) - f(2019))
```
