##  Обычная задача
> Исполнитель преобразует число на экране. У исполнителя есть две команды, которым присвоены номера:
>
>- **Прибавить 1**
>- **Умножить на 2**
> 
>Первая из них увеличивает число на экране на 1, вторая увеличивает число вдвое.<br>
Программа для исполнителя – это последовательность команд.<br>
Сколько существует программ, для которых при исходном числе 3 результатом является число 8?<br>
Траектория вычислений программы – это последовательность результатов выполнения всех команд программы.<br>
Например, для программы 122 при исходном числе 2 траектория состоит из чисел 3, 6, 12.<br>

```python
from functools import *

@lru_cache(None)
def f(x, end):
    if x > end: # Если ушли дальше нужного нам числа, то назад уже никак вернуться не сможем. Возвращаем 0.
        return 0
    if x == end: # Пришли в нужное число. Возвращаем 1.
        return 1
    return f(x + 1, end) + f(x * 2, end) # Суммируем все команды

print(f(3, 8)) # Получаем ответ
```

## Задача с запрещённым числом
>Исполнитель преобразует число на экране. У исполнителя есть две команды, которым присвоены номера:
> - **Прибавить 1**
> - **Умножить на 2**
>
> Первая из них увеличивает число на экране на 1, вторая увеличивает число вдвое.<br>
> Программа для исполнителя – это последовательность команд<br>
> Сколько существует программ, для которых при исходном числе 3 результатом является число 8, и при этом траектория вычислений не содержит число 5?<br>
> Траектория вычислений программы – это последовательность результатов выполнения всех команд программы.<br>
> Например, для программы 122 при исходном числе 2 траектория состоит из чисел 3, 6, 12.<br>

```python
from functools import *

@lru_cache(None)
def f(x, end):
    if x == 5: # Если пришли в запрещённое число, то возвращаем 0
        return 0
    if x > end: # Если ушли дальше нужного нам числа, то назад уже никак вернуться не сможем. Возвращаем 0.
        return 0
    if x == end: # Пришли в нужное число. Возвращаем 1.
        return 1
    return f(x + 1, end) + f(x * 2, end) # Суммируем все команды

print(f(3, 8)) # Получаем ответ
```