# 15 задание
## Навигация
- [Первый тип](#f_type)
- [Второй тип](#s_type)
## <a id="f_type"></a>Тип 1(A число)
Пример:
>Обозначим через m & n поразрядную конъюнкцию неотрицательных целых чисел m и n. Так, например, 14 & 5 = 1110 & 0101 = 0100 = 4.
>>(((x & 42 ≠ 0) /\ (x & 34 = 0)) → ¬(x & А = 0)) == 1
>
> Для какого наименьшего неотрицательного целого числа А формула

Пример решения:
```python3
def check(a):
    for x in range(0, 100500):
        f1 = x & 42 != 0
        f2 = x & 34 == 0
        f3 = x & a == 0
        f = (f1 and f2) <= (not f3) 
        if f != 1:
            return 0
    return 1


for A in range(1, 10000):
    if check(A) == 1:
        print(A)
```
Обращаем внимание на `неотрицательного целог числа А` от этого завист `range` в функции
Впринципе эквивалентно такому коду:
```python
for a in range(1, 100500):
    for x in range(1, 100500):
        f1 = x & 42 != 0
        f2 = x & 34 == 0
        f3 = x & a == 0
        f = (f1 and f2) <= (not f3) 
        if f != 1:
            break
    print(a)
```
Просто для удобства и простого предстваления делаем через функции

Еще пример:
> Укажите наименьшее целое значение А, при котором выражение истинно для любых целых положительных значений x и y.
>>(2y + x < A) ∨ (x > 10) ∨ (y > 25)
```python
def check(a):
    for x in range(1, 1000):
        for y in range(1, 1000):
            if ((y + 2 * x < a) or (x > 20) or (y > 30)) != 1:
                return 0
    return 1


for a in range(1, 1000):
    if check(a):
        print(a)
```
## <a id="s_type"></a> Второй тип(А не число)
Чтобы найти длину отрезка(интервала, полуинтервала) – нужно из его конца вычесть начало.
Примеры:
- Длина отрезка `[1; 68]` равняется **68 - 1 = 67**
- Длина полуинтервала `(1; 68]` равняется **68 - 1 = 67**
- Длина полуинтервала `[1; 68)` равняется **68 - 1 = 67**
- Длина интервала `(1; 68)` равняется **68 - 1 = 67**

Как вы видите строгость границы не влияет на длину.

Пример:
>На числовой прямой даны два отрезка: D = [17; 58] и C = [29; 80].
>>(x ∈ D) → ((¬(x ∈ C) /\ ¬(x ∈ A)) → ¬(x ∈ D)) == 1
> 
> Укажите наименьшую возможную длину такого отрезка A, для которого логическое выражение

Пример решения:
```python
A = 0 # При нахождении наименьшего отрезка ставим 0, наибольшего 1
f_usl = 1 # Выставляем значение логического выражения из условия
last_x = 17 - 0.25 # Для удобства нахождения разрывов в console
for x in [k*0.25 for k in range(-10_000, 10_000)]:
    D = 17 <= x <= 58
    C = 29 <= x <= 80
    f = D <= (((not C) and (not A)) <= (not D))
    if f != f_usl: # При нахождении наименьшего отрезка ставим !=, наибольшего ==
        print(x)
    last_x = x
```
Чтобы найти ответ, надо из максимального выведенного числа вычесть минимальное и результат округлить вверх.
```pycon
17.0
17.25
.....
28.5
28.75
```
В данном случае ответ: `28.75 - 17.0 = 11.75 = 12.`
Бывают разрывы отрезков. Просто в console мы выводим не только `x`, но и `diff(x, previos_x)`. 
`diff(x, previos_x)` должно равняться `0.25`