# 24 таск
## Навигация
- [Полезные приемы и функции](#полезные-приемы-и-функции)

## Полезные приемы и функции
1. **replace + split**
    ```python
    "".replace("???", "???").split("???")
    ```
2. **словари**
    ```python
    with open("../data/s2.txt", "r") as f:
    line = f.readline()
    d = dict()
    for s in line:
        if not d.get(s):
            d[s] = 1
        else:
            d[s] += 1
    print(min(d.items(), key=lambda x: x[1]))
    ```
3. > Определите сколько в файле восходящих последовательностей длиной 5, не входящих в восходящие последовательности большей длины.
    ```python
   with open("../data/j6.txt") as f:
    line = f.readline()
    cnt = 1
    mx = 0
    for i in range(1, len(line)):
        if int(line[i - 1]) < int(line[i]):
            cnt += 1
        else:
            if cnt == 5:
                mx += 1
            cnt = 1
    if cnt == 5:
        mx += 1
    print(mx)
    ```
4. Динамка

   Суть задачи в создание списка забитого нулями и равным длине строки. Определяем начало и прописываем длину последовательности.
   Определяемся, до куда откатываемся при не срабатывание условия. Выводи ответ на задачу.
   >(Е. Джобс) Текстовый файл 24-173.txt состоит не более чем из 106 символов и содержит только заглавные буквы латинского алфавита (ABC…Z). Найдите максимальную длину подстроки, в которой ни одна тройка символов не записана два раза подряд.<br> 
   > Например, в искомой подстроке не может быть фрагмента ABCABC.
   ```python
   with open("../data/24-173.txt") as f:
       line = f.readline()
       lst = [0] * len(line)
       lst[0] = 1
       lst[1] = 2
       lst[2] = 3
       lst[3] = 4
       lst[4] = 5
       for i in range(5, len(line)):
           if line[i-2:i+1] != line[i-5:i-2]:
               lst[i] = lst[i - 1] + 1
           else:
               lst[i] = 5
       print(max(lst))
   
   ```
   `Для удобства можно сместить индексы, сделав длину списка на 1 больше.`
5. Два цикла
   > (ЕГЭ-2024) Текстовый файл 24-295.txt состоит не более чем из 106 символов и содержит только буквы латинского алфавита A, B, C, D, E и F. Определите максимальное количество идущих подряд символов в прилагаемом файле, среди которых пара символов DE (в указанном порядке) встречается не более 240 раз.
    ```python3
   with open("../data/24-295.txt") as f:
    line = f.readline()
    mx = 0

    for l in range(len(line)):
        for r in range(l + mx, len(line)):
            pattern = line[l:r + 1]
            if pattern.count("DE") <= 240:
                mx = max(mx, len(pattern))
            else:
                break
    print(mx)
    ```
   В общем, делаем два цикла с левой и правой границой. Двигаем границы - на **один шаг** левой **все значения** от `левой + текущий макс` до конца строки. Правый мы начием так, чтобы сократить количество итераций. Получаеться, когда мы нашли больше 240 повторений мы ищем строки в которых нет больще подтсроки `DE`, иначе мы будем пербирать все заново.
6. 